
{
  "en": {
    "logo": "Immobilier Afella Jaouad",
    "contactUs": "Contact Us",
    "footerRights": "Immobilier Afella Jaouad. All rights reserved.",
    "headline1": "Discover Your Golden Opportunity.",
    "headline2": "Invest in the Future of Dakhla.",
    "headline3": "Own a Piece of Paradise.",
    "hero_p": "Immobilier Afella Jaouad is your exclusive gateway to acquiring premium land in Dakhla, Morocco — a region poised for exponential growth.",
    "discover_lands": "Discover Lands",
    "home_about_title": "Jaouad Afella: Your Guide to Dakhla's Golden Sands",
    "home_about_p1": "With over 6 years of experience in the Moroccan real estate market, Jaouad Afella isn't just an agent; he's a visionary who foresaw the immense potential of Dakhla. His deep-rooted connections and unparalleled market knowledge make him the most trusted name for land acquisition in the region.",
    "home_about_p2": "Our mission is to provide investors with exclusive access to premium land plots, ensuring transparency, security, and exceptional returns. We build relationships based on trust and a shared vision for a prosperous future in Dakhla.",
    "learnMoreAboutJaouad": "Learn More About Jaouad",
    "home_why_dakhla_title": "Why Dakhla? The Investment of a Lifetime",
    "home_why_dakhla_p1": "Dakhla is more than a destination; it's a future-forward hub for tourism, renewable energy, and aquaculture. With strategic government investment and a booming economy, the value of land is set on a dramatic upward trajectory.",
    "home_why_dakhla_card1_title": "Strategic Location",
    "home_why_dakhla_card1_p": "Positioned as a gateway between Europe and Africa, Dakhla is a pivotal center for international trade and logistics.",
    "home_why_dakhla_card2_title": "Economic Boom",
    "home_why_dakhla_card2_p": "Massive infrastructure projects, including the Dakhla Atlantic Port, are fueling unprecedented economic growth.",
    "home_why_dakhla_card3_title": "Tourism Hotspot",
    "home_why_dakhla_card3_p": "World-renowned for kitesurfing and its stunning natural beauty, Dakhla's tourism sector is expanding rapidly, driving demand for land.",
    "exploreDakhlaPotential": "Explore Dakhla's Potential",
    "properties_hero_title": "Available Land Plots",
    "properties_hero_p": "Explore our curated selection of premium land in Dakhla. Each plot represents a unique opportunity for growth and prosperity in this dynamic region.",
    "back_to_properties": "Back to Properties",
    "sqm": "sqm",
    "inquire_now": "Inquire Now",
    "key_features": "Key Features",
    "property_location": "Property Location",
    "not_found_title": "Lost in the Desert?",
    "not_found_p": "The page you are looking for seems to have drifted away like a sand dune. Let's get you back on track.",
    "go_back_home": "Go Back to Home",
    "dakhla_hero_title": "Dakhla: The Atlantic's Rising Star",
    "dakhla_hero_p": "More than just a pristine landscape, Dakhla is a region undergoing a profound transformation. Strategic vision and massive investment are unlocking its potential as a global hub for trade, tourism, and sustainable energy.",
    "dakhla_charts_title": "Projected Growth & Key Sectors",
    "dakhla_port_title": "The Dakhla Atlantic Port",
    "dakhla_port_p": "This monumental $1 billion project is the cornerstone of Dakhla's economic strategy. It will establish the region as a major maritime gateway, connecting Northwest Africa to the Americas and Europe. The port will create a logistical and industrial powerhouse, drastically increasing the value and utility of surrounding land for commercial and industrial purposes.",
    "dakhla_tourism_title": "A Global Tourism Destination",
    "dakhla_tourism_p": "Dakhla's world-class kitesurfing conditions, stunning lagoon, and unique desert-ocean scenery are attracting a surge of international tourists. The government's 'Vision 2020' and subsequent tourism strategies are fueling the development of luxury resorts, eco-lodges, and entertainment facilities, creating high demand for land in prime locations.",
    "dakhla_energy_title": "The Green Energy Revolution",
    "dakhla_energy_p": "Harnessing its abundant wind and solar resources, Dakhla is becoming a leader in renewable energy. Major projects are underway to generate clean electricity for Morocco and for export. This green revolution is not only sustainable but also creates new industries, including green hydrogen production, attracting a skilled workforce and further stimulating the local economy.",
    "dakhla_cta_title": "Your Moment is Now",
    "dakhla_cta_p": "The confluence of these mega-projects creates a once-in-a-generation investment opportunity. By acquiring land in Dakhla today, you are positioning yourself at the forefront of Africa's next great success story.",
    "view_available_properties": "View Available Properties",
    "contact_hero_title": "Connect With Us",
    "contact_hero_p": "Your journey towards a landmark investment in Dakhla begins here. Reach out to our team for personalized consultations and property inquiries.",
    "send_a_message": "Send a Message",
    "contact_info": "Contact Information",
    "contact_info_p": "We are available to answer your questions and guide you through every step of the investment process.",
    "contact_office_address": "Office: Avenue Al-Walaa, Dakhla, Morocco",
    "message_on_whatsapp": "Message on WhatsApp",
    "about_hero_title": "The Visionary Behind Dakhla's Premier Land Agency",
    "about_hero_p": "A legacy of trust, a future of prosperity.",
    "about_jaouad_title": "About Jaouad Afella",
    "about_jaouad_p1": "Jaouad Afella is more than a real estate agent; he is a cornerstone of the Dakhla property market. With a career spanning over six years, he has meticulously cultivated a reputation for integrity, foresight, and an unwavering commitment to his clients' success.",
    "about_jaouad_p2": "Born and raised in Morocco, Jaouad possesses an intrinsic understanding of the cultural and economic landscapes that shape the nation's real estate trends. He was among the first to recognize Dakhla's nascent potential, dedicating his focus to the region long before it captured the international spotlight. This pioneering spirit has granted him an unparalleled network and a portfolio of the most exclusive land opportunities available.",
    "about_jaouad_p3": "His philosophy is simple: to facilitate investments that are not only profitable but also contribute positively to the sustainable development of the Dakhla region.",
    "our_mission_title": "Our Mission",
    "our_mission_p": "To be the most trusted and sought-after real estate partner for land investment in Dakhla, providing our clients with secure, high-return opportunities through expert guidance and unmatched market access.",
    "our_credibility_title": "Our Credibility",
    "our_credibility_p": "Built on a foundation of successful transactions and satisfied investors, our credibility is our greatest asset. We operate with complete transparency and a deep-seated ethical code.",
    "our_values_title": "Our Values",
    "our_values_p": "Integrity, Excellence, and Partnership. We believe in building long-term relationships and ensuring every client feels confident and valued throughout their investment journey.",
    "invest_with_confidence_title": "Invest with Confidence",
    "invest_with_confidence_p": "Join a growing list of investors who have trusted Jaouad Afella to navigate the promising landscape of Dakhla's real estate market.",
    "form_error_name": "Name must be at least 2 characters.",
    "form_error_email": "Please enter a valid email address.",
    "form_error_message": "Message must be at least 10 characters.",
    "form_error_budget": "Please select a budget range.",
    "form_error_property_type": "Please select a property type.",
    "toast_success_title": "Message Sent!",
    "toast_success_p": "Thank you for your inquiry. We will get back to you shortly.",
    "toast_error_p": "An error occurred. Please try again later.",
    "form_label_name": "Full Name",
    "form_placeholder_name": "John Doe",
    "form_label_email": "Email Address",
    "form_placeholder_email": "john.doe@example.com",
    "form_label_phone": "Phone Number",
    "form_placeholder_phone": "+1 (555) 123-4567",
    "form_label_message": "Your Message",
    "form_placeholder_message": "I'm interested in learning more about land opportunities in Dakhla...",
    "form_label_budget": "Budget Range",
    "form_placeholder_budget": "Select your budget",
    "form_label_property_type": "Preferred Property Type",
    "form_placeholder_property_type": "Select a property type",
    "form_label_details": "Additional Details",
    "form_placeholder_details": "Any other information or specific questions...",
    "send_inquiry": "Send Inquiry",
    "chart_sector_tourism": "Tourism",
    "chart_sector_logistics": "Logistics & Port",
    "chart_sector_energy": "Renewable Energy",
    "chart_sector_aquaculture": "Aquaculture & Fishing",
    "chart_legend_current": "Current Investment (Millions USD)",
    "chart_legend_projected": "Projected Investment",
    "chart_title": "Dakhla 2030: A Vision of Growth",
    "chart_desc": "From strategic ports to green energy, discover the key sectors driving Dakhla's multi-billion dollar transformation. All figures in millions USD.",
    "ai_investment_analysis": "AI Investment Analysis",
    "ai_investment_p": "Leverage our AI-powered analyst to get an instant, data-driven assessment of this property's investment potential, considering market trends, location advantages, and growth forecasts in Dakhla.",
    "analyze_investment_potential": "Analyze Investment Potential",
    "analyze_investment_short": "Analyze",
    "generating_analysis": "Generating Analysis...",
    "no_properties_match": "No properties match the current filters.",
    "try_adjusting_search": "Try adjusting your search criteria.",
    "view_details": "View Details",
    "location": "Location",
    "all_locations": "All Locations",
    "location_coastal": "Coastal",
    "location_inland": "Inland",
    "location_urban": "Urban",
    "location_industrial": "Industrial",
    "price": "Price",
    "any_price": "Any Price",
    "any_type": "Any Type",
    "size": "Size",
    "any_size": "Any Size",
    "growth": "Growth",
    "chatbot_welcome": "Hello! How can I help you today?",
    "ask_another_question": "Ask Another Question",
    "download_analysis": "Download Analysis",
    "appreciation_projection": "Appreciation Projection",
    "Filters": "Filters",
    "reset": "Reset",
    "apply_filters": "Apply Filters",
    "Optional": "Optional",
    "pagination_previous": "Previous",
    "pagination_next": "Next",
    "pagination_page": "Page {{currentPage}} of {{totalPages}}"
  },
  "ar": {
    "logo": "وكالة عقارات جواد أفلا",
    "contactUs": "اتصل بنا",
    "footerRights": "وكالة عقارات جواد أفلا. جميع الحقوق محفوظة.",
    "headline1": "اكتشف فرصتك الذهبية.",
    "headline2": "استثمر في مستقبل الداخلة.",
    "headline3": "امتلك قطعتك الارضية الان.",
    "hero_p": "وكالة عقارات جواد أفلا هي بوابتك الحصرية للحصول على أراضٍ فاخرة في الداخلة، المغرب — منطقة مهيأة لنمو هائل.",
    "discover_lands": "اكتشف الأراضي",
    "home_about_title": "جواد أفلا: دليلك إلى رمال الداخلة الذهبية",
    "home_about_p1": "بخبرة تزيد عن 6 سنوات في سوق العقارات المغربي، جواد أفلا ليس مجرد وكيل؛ إنه صاحب رؤية استشرف الإمكانات الهائلة للداخلة. علاقاته العميقة ومعرفته التي لا تضاهى بالسوق تجعله الاسم الأكثر ثقة للحصول على الأراضي في المنطقة.",
    "home_about_p2": "مهمتنا هي تزويد المستثمرين بفرصة حصرية للحصول على قطع أراضٍ ممتازة، مع ضمان الشفافية والأمان والعوائد الاستثنائية. نحن نبني علاقات مبنية على الثقة ورؤية مشتركة لمستقبل مزدهر في الداخلة.",
    "learnMoreAboutJaouad": "اعرف المزيد عن جواد",
    "home_why_dakhla_title": "لماذا الداخلة؟ استثمار العمر",
    "home_why_dakhla_p1": "الداخلة أكثر من مجرد وجهة؛ إنها مركز مستقبلي للسياحة والطاقة المتجددة وتربية الأحياء المائية. مع استثمارات حكومية استراتيجية واقتصاد مزدهر، فإن قيمة الأراضي في مسار تصاعدي كبير.",
    "home_why_dakhla_card1_title": "موقع استراتيجي",
    "home_why_dakhla_card1_p": "كمدخل بين أوروبا وأفريقيا، تعد الداخلة مركزًا محوريًا للتجارة والخدمات اللوجستية الدولية.",
    "home_why_dakhla_card2_title": "ازدهار اقتصادي",
    "home_why_dakhla_card2_p": "مشاريع البنية التحتية الضخمة، بما في ذلك ميناء الداخلة الأطلسي، تغذي نموًا اقتصاديًا غير مسبوق.",
    "home_why_dakhla_card3_title": "نقطة جذب سياحي",
    "home_why_dakhla_card3_p": "يشهد قطاع السياحة في الداخلة، المشهور عالميًا بركوب الأمواج شراعيًا وجماله الطبيعي الخلاب، توسعًا سريعًا، مما يزيد الطلب على الأراضي.",
    "exploreDakhlaPotential": "اكتشف إمكانات الداخلة",
    "properties_hero_title": "قطع الأراضي المتاحة",
    "properties_hero_p": "استكشف مجموعتنا المختارة من الأراضي المتميزة في الداخلة. تمثل كل قطعة فرصة فريدة للنمو والازدهار في هذه المنطقة الديناميكية.",
    "back_to_properties": "العودة إلى العقارات",
    "sqm": "متر مربع",
    "inquire_now": "استفسر الآن",
    "key_features": "الميزات الرئيسية",
    "property_location": "موقع العقار",
    "not_found_title": "تائه في الصحراء؟",
    "not_found_p": "يبدو أن الصفحة التي تبحث عنها قد انجرفت بعيدًا مثل كثبان رملية. دعنا نعيدك إلى المسار الصحيح.",
    "go_back_home": "العودة إلى الصفحة الرئيسية",
    "dakhla_hero_title": "الداخلة: نجم الأطلسي الصاعد",
    "dakhla_hero_p": "أكثر من مجرد مناظر طبيعية خلابة، الداخلة هي منطقة تشهد تحولًا عميقًا. الرؤية الاستراتيجية والاستثمارات الضخمة تطلق العنان لإمكانياتها كمركز عالمي للتجارة والسياحة والطاقة المستدامة.",
    "dakhla_charts_title": "الداخلة 2030: رؤية للنمو",
    "dakhla_port_title": "ميناء الداخلة الأطلسي",
    "dakhla_port_p": "هذا المشروع الضخم الذي تبلغ تكلفته مليار دولار هو حجر الزاوية في استراتيجية الداخلة الاقتصادية. سيؤسس المنطقة كبوابة بحرية رئيسية تربط شمال غرب أفريقيا بالأمريكتين وأوروبا. سيخلق الميناء قوة لوجستية وصناعية، مما يزيد بشكل كبير من قيمة وفائدة الأراضي المحيطة للأغراض التجارية والصناعية.",
    "dakhla_tourism_title": "وجهة سياحية عالمية",
    "dakhla_tourism_p": "تجذب ظروف ركوب الأمواج شراعيًا ذات المستوى العالمي في الداخلة، والبحيرة المذهلة، والمناظر الطبيعية الفريدة التي تجمع بين الصحراء والمحيط، تدفقًا كبيرًا من السياح الدوليين. تغذي 'رؤية 2020' الحكومية واستراتيجيات السياحة اللاحقة تطوير المنتجعات الفاخرة والنزل البيئية والمرافق الترفيهية، مما يخلق طلبًا كبيرًا على الأراضي في المواقع الرئيسية.",
    "dakhla_energy_title": "ثورة الطاقة الخضراء",
    "dakhla_energy_p": "من خلال تسخير مواردها الوفيرة من الرياح والطاقة الشمسية، أصبحت الداخلة رائدة في مجال الطاقة المتجددة. هناك مشاريع كبرى قيد التنفيذ لتوليد كهرباء نظيفة للمغرب وللتصدير. هذه الثورة الخضراء ليست مستدامة فحسب، بل تخلق أيضًا صناعات جديدة، بما في ذلك إنتاج الهيدروجين الأخضر، مما يجذب قوة عاملة ماهرة ويحفز الاقتصاد المحلي بشكل أكبر.",
    "dakhla_cta_title": "لحظتك هي الآن",
    "dakhla_cta_p": "يخلق التقاء هذه المشاريع الضخمة فرصة استثمارية لا تتكرر إلا مرة واحدة في الجيل. من خلال حيازة الأراضي في الداخلة اليوم، فإنك تضع نفسك في طليعة قصة نجاح أفريقيا العظيمة التالية.",
    "view_available_properties": "عرض العقارات المتاحة",
    "contact_hero_title": "تواصل معنا",
    "contact_hero_p": "رحلتك نحو استثمار تاريخي في الداخلة تبدأ هنا. تواصل مع فريقنا للحصول على استشارات شخصية واستفسارات حول العقارات.",
    "send_a_message": "أرسل رسالة",
    "contact_info": "معلومات الاتصال",
    "contact_info_p": "نحن متاحون للإجابة على أسئلتك وإرشادك في كل خطوة من خطوات عملية الاستثمار.",
    "contact_office_address": "المكتب: شارع الولاء، الداخلة، المغرب",
    "message_on_whatsapp": "راسلنا على واتساب",
    "about_hero_title": "صاحب الرؤية خلف وكالة الأراضي الرائدة في الداخلة",
    "about_hero_p": "إرث من الثقة، مستقبل من الازدهار.",
    "about_jaouad_title": "عن جواد أفلا",
    "about_jaouad_p1": "جواد أفلا هو أكثر من مجرد وكيل عقاري؛ إنه حجر الزاوية في سوق العقارات في الداخلة. بمسيرة مهنية تمتد لأكثر من ست سنوات، بنى بدقة سمعة من النزاهة والبصيرة والالتزام الراسخ بنجاح عملائه.",
    "about_jaouad_p2": "ولد ونشأ جواد في المغرب، ويمتلك فهمًا جوهريًا للمناظر الطبيعية الثقافية والاقتصادية التي تشكل اتجاهات العقارات في البلاد. كان من أوائل الذين أدركوا إمكانات الداخلة الناشئة، وكرس تركيزه على المنطقة قبل فترة طويلة من جذبها للأضواء الدولية. منحته هذه الروح الريادية شبكة لا مثيل لها ومجموعة من أكثر فرص الأراضي حصرية المتاحة.",
    "about_jaouad_p3": "فلسفته بسيطة: تسهيل الاستثمارات التي ليست مربحة فحسب، بل تساهم أيضًا بشكل إيجابي في التنمية المستدامة لمنطقة الداخلة.",
    "our_mission_title": "مهمتنا",
    "our_mission_p": "أن نكون الشريك العقاري الأكثر ثقة وطلبًا للاستثمار في الأراضي في الداخلة، وتزويد عملائنا بفرص آمنة وعالية العائد من خلال التوجيه الخبير والوصول إلى السوق الذي لا يضاهى.",
    "our_credibility_title": "مصداقيتنا",
    "our_credibility_p": "مبنية على أساس من المعاملات الناجحة والمستثمرين الراضين، مصداقيتنا هي أعظم أصولنا. نعمل بشفافية كاملة ومدونة أخلاقية عميقة الجذور.",
    "our_values_title": "قيمنا",
    "our_values_p": "النزاهة والتميز والشراكة. نحن نؤمن ببناء علاقات طويلة الأمد وضمان شعور كل عميل بالثقة والتقدير طوال رحلته الاستثمارية.",
    "invest_with_confidence_title": "استثمر بثقة",
    "invest_with_confidence_p": "انضم إلى قائمة متزايدة من المستثمرين الذين وثقوا في جواد أفلا للتنقل في المشهد الواعد لسوق العقارات في الداخلة.",
    "form_error_name": "يجب أن يتكون الاسم من حرفين على الأقل.",
    "form_error_email": "الرجاء إدخال عنوان بريد إلكتروني صالح.",
    "form_error_message": "يجب أن تتكون الرسالة من 10 أحرف على الأقل.",
    "form_error_budget": "الرجاء تحديد نطاق الميزانية.",
    "form_error_property_type": "الرجاء تحديد نوع العقار.",
    "toast_success_title": "تم إرسال الرسالة!",
    "toast_success_p": "شكرًا لاستفسارك. سنتواصل معك قريبًا.",
    "toast_error_p": "حدث خطأ. يرجى المحاولة مرة أخرى في وقت لاحق.",
    "form_label_name": "الاسم الكامل",
    "form_placeholder_name": "فلان الفلاني",
    "form_label_email": "عنوان البريد الإلكتروني",
    "form_placeholder_email": "john.doe@example.com",
    "form_label_phone": "رقم الهاتف",
    "form_placeholder_phone": "+212 6 00 00 00 00",
    "form_label_message": "رسالتك",
    "form_placeholder_message": "أنا مهتم بمعرفة المزيد عن فرص الأراضي في الداخلة...",
    "form_label_budget": "نطاق الميزانية",
    "form_placeholder_budget": "اختر ميزانيتك",
    "form_label_property_type": "نوع العقار المفضل",
    "form_placeholder_property_type": "اختر نوع العقار",
    "form_label_details": "تفاصيل إضافية",
    "form_placeholder_details": "أي معلومات أخرى أو أسئلة محددة...",
    "send_inquiry": "إرسال استفسار",
    "chart_sector_tourism": "السياحة",
    "chart_sector_logistics": "الخدمات اللوجستية والميناء",
    "chart_sector_energy": "الطاقة المتجددة",
    "chart_sector_aquaculture": "تربية الأحياء المائية والصيد",
    "chart_legend_current": "الاستثمار الحالي (مليون دولار أمريكي)",
    "chart_legend_projected": "الاستثمار المتوقع",
    "chart_title": "الداخلة 2030: رؤية للنمو",
    "chart_desc": "من الموانئ الاستراتيجية إلى الطاقة الخضراء، اكتشف القطاعات الرئيسية التي تقود تحول الداخلة بمليارات الدولارات. جميع الأرقام بملايين الدولارات الأمريكية.",
    "ai_investment_analysis": "تحليل استثمار الذكاء الاصطناعي",
    "ai_investment_p": "استفد من محللنا المدعوم بالذكاء الاصطناعي للحصول على تقييم فوري ومستند إلى البيانات لإمكانيات الاستثمار في هذا العقار، مع مراعاة اتجاهات السوق والمزايا الموقع وتوقعات النمو في الداخلة.",
    "analyze_investment_potential": "تحليل إمكانات الاستثمار",
    "analyze_investment_short": "تحليل",
    "generating_analysis": "جاري إنشاء التحليل...",
    "no_properties_match": "لا توجد عقارات تطابق المرشحات الحالية.",
    "try_adjusting_search": "حاول تعديل معايير البحث الخاصة بك.",
    "view_details": "عرض التفاصيل",
    "location": "الموقع",
    "all_locations": "جميع المواقع",
    "location_coastal": "ساحلي",
    "location_inland": "داخلي",
    "location_urban": "حضري",
    "location_industrial": "صناعي",
    "price": "السعر",
    "any_price": "أي سعر",
    "any_type": "أي نوع",
    "size": "المساحة",
    "any_size": "أي مساحة",
    "growth": "نمو",
    "chatbot_welcome": "مرحباً! كيف يمكنني مساعدتك اليوم؟",
    "ask_another_question": "اطرح سؤالاً آخر",
    "download_analysis": "تحميل التحليل",
    "appreciation_projection": "توقع التقييم",
    "Filters": "الفلاتر",
    "reset": "إعادة تعيين",
    "apply_filters": "تطبيق الفلاتر",
    "Optional": "اختياري",
    "pagination_previous": "السابق",
    "pagination_next": "التالي",
    "pagination_page": "صفحة {{currentPage}} من {{totalPages}}"
  }
}
